ApoteketRetryAdapter-schemas/src/main/resources/schemas/TD_DRUGLOGISTICS_DOSEDISPENSING_1_1_0/interactions/HamtaMeddelandenInteraction/HamtaMeddelandenInteraction_1.0_RIVTABP20.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<!-- 
 Licensed to the Apache Software Foundation (ASF) under one
 or more contributor license agreements. See the NOTICE file
 distributed with this work for additional information
 regarding copyright ownership.  licenses this file
 to you under the Apache License, Version 2.0 (the
 "License"); you may not use this file except in compliance
 with the License. You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing,
 software distributed under the License is distributed on an
 "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 KIND, either express or implied. See the License for the
 specific language governing permissions and limitations
 under the License.
 -->		
<wsdl:definitions name='HamtaMeddelandenInteraction' xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/' xmlns:soap='http://schemas.xmlsoap.org/wsdl/soap/' xmlns:xs='http://www.w3.org/2001/XMLSchema' xmlns:wsa='http://www.w3.org/2005/08/addressing' xmlns:tjsr='urn:riv:druglogistics:dosedispensing:HamtaMeddelandenResponder:1' xmlns:tjsi='urn:riv:druglogistics:dosedispensing:HamtaMeddelandenInitiator:1' xmlns:tns='urn:riv:druglogistics:dosedispensing:HamtaMeddelanden:1:rivtabp20' targetNamespace='urn:riv:druglogistics:dosedispensing:HamtaMeddelanden:1:rivtabp20'>
  <xs:annotation>
    <xs:documentation>
			 Tjänsteinteraktionens namn: HamtaMeddelandenInteraction
			 Beskrivning: 
			   
			 Revisioner: 
			 Tjänstedomän: druglogistics:dosedispensing
			 Tjänsteinteraktionstyp: Fråga-Svar
			 WS-profil: RIVTABP20
			 Förvaltas av: Sveriges Kommuner och Landsting
			 </xs:documentation>
  </xs:annotation>
  <wsdl:types>
    <xs:schema targetNamespace='urn:riv:druglogistics:dosedispensing:HamtaMeddelanden:1:rivtabp20'>
      <xs:import schemaLocation='HamtaMeddelandenResponder_1.0.xsd' namespace='urn:riv:druglogistics:dosedispensing:HamtaMeddelandenResponder:1' />
      <xs:import schemaLocation='../../core_components/ws-addressing-1.0.xsd' namespace='http://www.w3.org/2005/08/addressing' />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name='HamtaMeddelandenRequest'>
	<xs:annotation>
			<xs:documentation>
				LogicalAddress is the organization number of the business partner (e.g. the org. no. of Apoteket AB).
			</xs:documentation>
		</xs:annotation>
    <wsdl:part name='LogicalAddress' element='wsa:To'>
    </wsdl:part>
    <wsdl:part name='parameters' element='tjsr:HamtaMeddelanden' />
  </wsdl:message>
  <wsdl:message name='HamtaMeddelandenResponse'>
    <wsdl:part name='parameters' element='tjsr:HamtaMeddelandenResponse' />
  </wsdl:message>
  <wsdl:portType name='HamtaMeddelandenResponderInterface'>
    <wsdl:operation name='HamtaMeddelanden'>
      <wsdl:input message='tns:HamtaMeddelandenRequest' />
      <wsdl:output message='tns:HamtaMeddelandenResponse' />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name='HamtaMeddelandenResponderBinding' type='tns:HamtaMeddelandenResponderInterface'>
    <soap:binding style='document' transport='http://schemas.xmlsoap.org/soap/http' />
    <wsdl:operation name='HamtaMeddelanden'>
      <soap:operation soapAction='urn:riv:druglogistics:dosedispensing:HamtaMeddelandenResponder:1:HamtaMeddelanden' style='document' />
      <wsdl:input>
        <soap:header use='literal' message='tns:HamtaMeddelandenRequest' part='LogicalAddress' />
        <soap:body use='literal' parts='parameters' />
      </wsdl:input>
      <wsdl:output>
        <soap:body use='literal' />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name='HamtaMeddelandenResponderService'>
    <wsdl:port name='HamtaMeddelandenResponderPort' binding='tns:HamtaMeddelandenResponderBinding'>
      <soap:address location='http://tempuri.org' />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>